<?php
$static = array(
	'customer' => array(
		'mode' => array(
			1 => '个人',
			2 => '商家'
		)
	),
	'mobile' => array(
		1 => array(//品牌
			1 => '苹果(APPLE)',
			2 => '三星(SAMSUNG)',
			3 => '诺基亚(NOKIA)',
			4 => '索尼(SONY)',
			5 => 'HTC',
			6 => '摩托罗拉(Motorola)',
			//7 => '索尼爱立信(Sony Ericsson)',
			8 => '联想(Lenovo)',
			9 => '华为(HUAWEI)',
			10 => '魅族(MEIZU)',
			11 => 'OPPO',
			12 => 'LG',
			13 => '小米(MI)',
			14 => '中兴(ZTE)',
			15 => '其它'
		),
		2 => array(//交易方式
			1 => '仅供购买',
			2 => '仅供换机',
			3 => '可购买、可换机'
		),
		3 => array(//价格范围
			1 => array(
				'label' => '2500以上',
				'min' => 2500,
				'max' => 99999999
			),
			2 => array(
				'label' => '2500-2000',
				'min' => 2000,
				'max' => 2500
			),
			3 => array(
				'label' => '2000-1500',
				'min' => 1500,
				'max' => 2000
			),
			4 => array(
				'label' => '1500-1000',
				'min' => 1000,
				'max' => 1500
			),
			5 => array(
				'label' => '1000-500',
				'min' => 500,
				'max' => 1000
			),
			6 => array(
				'label' => '500-200',
				'min' => 200,
				'max' => 500
			),
			7 => array(
				'label' => '200以内',
				'min' => 0,
				'max' => 200
			),
			8 => array(
				'label' => '换机',
				'min' => 0,
				'max' => 0
			)
		),
		4 => array(//新旧程度
			1 => '全新',
			2 => '95成新',
			3 => '9成新',
			4 => '8成新',
			5 => '7成新',
			6 => '6成新',
			7 => '5成新或以下'
		),
		5 => array(//货源
			1 => '国行',
			2 => '港版',
			3 => '美版',
			4 => '联通版',
			5 => '电信版',
			6 => '其它版本'
		),
		6 => array(//操作系统
			1 => '安卓/Android',
			2 => '塞班/Symbian',
			3 => 'iOS',
			4 => 'Windows Mobile',
			5 => 'Windows Phone',
			6 => '其它',
			7 => '非智能机'
		),
		7 => array(//交易地区
			1 => '大良',
			2 => '容桂',
			3 => '北滘',
			4 => '龙江',
			5 => '杏坛',
			6 => '乐从',
			7 => '陈村',
			8 => '均安',
			9 => '勒流',
			10 => '伦教',
			11 => '其它'
		),
		8 => array(//信息有效期
			1 => array(
				'label' => '1周内',
				'limit' => 604800		
			),
			2 => array(
					'label' => '半个月内',
					'limit' => 1296000
			),
			3 => array(
					'label' => '一个月内',
					'limit' => 2592000
			),
			4 => array(
					'label' => '不限',
					'limit' => 0
			)
		),
		9 => array(//发布来源
			1 => '个人',
			2 => '商家'
		)
	),
	'filter' => array(
		'mobile' => array(
					1 => '价格范围',
					2 => '手机品牌',
					3 => '新旧程度',
					//4 => '手机版本',
					//5 => '手机系统',
					6 => '交易地区',
					7 => '卖家性质',
					8 => '手机型号'
				),
		'purchase' => array(
					1 => '手机品牌',
					2 => '交易地区'
					//3 => '卖家性质'
				)
	)
);

$MStatic = array(
	//新旧程度
	'newly' => array(
			1 => '全新',
			2 => '95成新',
			3 => '9成新',
			4 => '8成新',
			5 => '7成新或以下'
	),
	//价格范围
	'level' => array(
		1 => array(
			'label' => '2500以上',
			'min' => 2500,
			'max' => 99999999
		),
		2 => array(
			'label' => '2000-2500',
			'min' => 2000,
			'max' => 2500
		),
		3 => array(
			'label' => '1500-2000',
			'min' => 1500,
			'max' => 2000
		),
		4 => array(
			'label' => '1000-1500',
			'min' => 1000,
			'max' => 1500
		),
		5 => array(
			'label' => '500-1000',
			'min' => 500,
			'max' => 1000
		),
		6 => array(
			'label' => '200-500',
			'min' => 200,
			'max' => 500
		),
		7 => array(
			'label' => '200以内',
			'min' => 0,
			'max' => 200
		),
		8 => array(
			'label' => '换机',
			'min' => 0,
			'max' => 0
		)
	),
	//屏幕状况
	'screen' => array(
		1 => '无',
		2 => '轻微',
		3 => '明显',
		4 => '有破损裂痕'
	),
	//机身状况
	'pbody' => array(
		1 => '无',
		2 => '轻微',
		3 => '明显',
		4 => '有破损裂痕'
	),
	//剩余保修期
	'warranty' => array(
		1 => '无保修',
		2 => '少于3个月',
		3 => '超过3个月'
	),
	//维修史
	'repair' => array(
		1 => '无拆无修',
		2 => '修过小部件',
		3 => '修过屏幕',
		4 => '修过主板'
	),
	//手机配件
	'attachment' => array(
		1 => '正品发票',
		2 => '原装电池',
		3 => '非原装电池',
		4 => '原装充电器',
		5 => '非原装充电器',
		6 => '原装耳机',
		7 => '数据线',
		8 => '储存卡'
	),
	'cost' => array(
		1 => '仅供购买',
		2 => '仅供换机',
		3 => '可购买，可换机'
	)
);

$PStatic = array(
	//新旧程度
	'newly' => array(
			1 => '全新',
			2 => '95成新',
			3 => '9成新',
			4 => '8成新',
			5 => '7成新或以下'
	)
);

$CStatic = array(
	'mode' => array(
		1 => '个人',
		2 => '商家',
		99 => '黑名单用户'
	),
	'region' => array(//交易地区
		1 => '大良',
		2 => '容桂',
		3 => '北滘',
		4 => '龙江',
		5 => '杏坛',
		6 => '乐从',
		7 => '陈村',
		8 => '均安',
		9 => '勒流',
		10 => '伦教',
		11 => '其它地区'
	)
);
